using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class AboutPattern : MonoBehaviour
{
	
    // Тест Порождающие паттерны — это паттерны, которые абстрагируют
    // процесс инстанцирования или, иными словами, процесс
    // порождения классов и объектов.
    // Среди них выделяются следующие:

    //1) Абстрактная фабрика(Abstract Factory)
    //2) Строитель(Builder)
    //3) Фабричный метод(Factory Method)
    //4) Прототип(Prototype)
    //5) Одиночка(Singleton)


    //Cтруктурные паттерны - рассматривает, как классы и объекты 
    //образуют более крупные структуры - более сложные по характеру 
    //классы и объекты.К таким шаблонам относятся:

    //1) Адаптер(Adapter)
    //2) Мост(Bridge)
    //3) Компоновщик(Composite)
    //4) Декоратор(Decorator)
    //5) Фасад(Facade)
    //6) Приспособленец(Flyweight)
    //7) Заместитель(Proxy)

    //поведенческиие паттерны - они определяют алгоритмы и взаимодействие 
    //между классами и объектами, то есть их поведение.
    //Среди подобных шаблонов можно выделить следующие:

    //1) Цепочка обязанностей(Chain of responsibility)
    //2) Команда(Command)
    //3) Интерпретатор(Interpreter)
    //4) Итератор(Iterator)
    //5) Посредник(Mediator)
    //6) Хранитель(Memento)
    //7) Наблюдатель(Observer)
    //8) Состояние(State)
    //9) Стратегия(Strategy)
    //10) Шаблонный метод(Template method)
    //11) Посетитель(Visitor)

    //И в конечном счете надо придерживаться принципа KISS(Keep It Simple, Stupid) !!!!
}
